# brew bundle install --file /path/to/Brewfile

# 'brew tap'
tap "homebrew/cask"

brew "ansible" # brew install ansible
brew "awscli" # brew install awscli
brew "autoenv" # brew install autoenv

brew "bash" # brew install bash
brew "bash-completion" # brew install bash-completion

brew "cask" # brew install cask
brew "cookiecutter" # brew install cookiecutter

brew "detox" # brew install detox
brew "direnv" # brew install direnv
brew "dnsmasq" # brew install dnsmasq
brew "docker" # brew install docker
brew "docker-completion" # brew install docker-completion
brew "docker-compose-completion" # brew install docker-compose-completion
brew "docker-machine-completion" # brew install docker-machine-completion
brew "duti" # brew install duti

brew "findutils" # brew install findutils

brew "gdbm" # brew install gdbm
brew "gettext" # brew install gettext
brew "git" # brew install git
brew "glances" # brew install glances
brew "gnu-sed" # brew install gnu-sed
brew "gnu-tar" # brew install gnu-tar
brew "gnupg" # brew install gnupg

brew "htop" # brew install htop

brew "libxml2" # brew install libxml2
brew "lighttpd" # brew install lighttpd

brew "memcached" # brew install memcached

brew "nginx" # brew install nginx
brew "node" # brew install node

brew "objc-run" # brew install objc-run
brew "optipng" # brew install optipng
brew "openshift-cli" # brew install openshift-cli
brew "ossp-uuid" # brew install ossp-uuid

brew "pandoc" # brew install pandoc
brew "pidof" # brew install pidof
brew "pipenv" # brew install pipenv
brew "postgresql" # brew install postgresql
brew "pstree" # brew install pstree
brew "pyenv" # brew install pyenv
brew "pypy" # brew install pypy
brew "pypy3" # brew install pypy3
brew "python" # brew install python

brew "rabbitmq" # brew install rabbitmq
brew "rbenv" # brew install rbenv
brew "ruby-build" # brew install ruby-build

brew "smartmontools" # brew install smartmontools
brew "spawn-fcgi" # brew install spawn-fcgi
brew "sonarqube" # brew install sonarqube
brew "sqlite" # brew install sqlite
brew "supervisor" # brew install supervisor

brew "tag" # brew install tag
brew "terminal-notifier" # brew install terminal-notifier
brew "tmux" # brew install tmux
brew "travis" # brew install travis
brew "twine" # brew install twine

brew "watch" # brew install watch
brew "wget" # brew install wget

brew "yq" # brew install yq

# Applications

# brew install --cask --appdir=~/Applications alfred
cask "alfred", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications android-file-transfer
cask "android-file-transfer", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/my-apps/Applications apptivate
cask "apptivate", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications cd-to
cask "cd-to", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications chromium
cask "chromium", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications discord
cask "discord", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications docker
cask "docker", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications elmedia-player
cask "elmedia-player", args: { appdir: "~/Applications" }


# brew install --cask --appdir=~/Applications geektool
cask "geektool", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications google-chrome
cask "google-chrome", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications google-backup-and-sync
cask "google-backup-and-sync", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications growlnotify
cask "growlnotify", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications filezilla
cask "filezilla", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications firefox
cask "firefox", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications flash-player
cask "flash-player", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications iterm2
cask "iterm2", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications java
cask "java", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications little-snitch
cask "little-snitch", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications lunchy
cask "lunchy", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications ngrok
cask "ngrok", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications pgadmin4
cask "pgadmin4", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications sequential
cask "sequential", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications skitch
cask "skitch", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications skype
cask "skype", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications steam
cask "steam", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications sublime-text
cask "sublime-text", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications transmission
cask "transmission", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications vlc
cask "vlc", args: { appdir: "~/Applications" }
# brew install --cask --appdir=~/Applications vox
cask "vox", args: { appdir: "~/Applications" }

# brew install --cask --appdir=~/Applications ubersicht
cask "ubersicht", args: { appdir: "~/Applications" }
